Wiznet/wsm_driver/examples/http/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 1 ms tick: the TOE poll loops (wiztoe_accept/recv) yield in 1 ms steps and
# count those steps for SO_RCVTIMEO/SO_SNDTIMEO. At the IDF default of 100 Hz a
# 1 ms delay truncates to 0 ticks, which busy-waits and starves the idle task.
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# --- esp_wiz_toe shared settings ---
CONFIG_ESP_WIZ_TOE_ENABLED=y
CONFIG_ESP_WIZ_TOE_CHIP_W6300=y
# Network backend. TOE routes the example's socket calls to the chip's hardware
# TCP/IP via -Wl,--wrap (__wrap_lwip_*); switch to
# CONFIG_ESP_WIZ_TOE_BACKEND_ETH=y under
#   Component config -> WIZnet TOE Component -> Network backend
# to run the very same http.c over esp_eth MACRAW + software LwIP (lwip_*).
CONFIG_ESP_WIZ_TOE_BACKEND_TOE=y
# pins/clock/QSPI come from the component Kconfig W6300 defaults. Those symbols
# have no prompt (hidden), so they CANNOT be overridden from here or from
# sdkconfig -- kconfgen always regenerates them from their `default`. To rewire,
# edit the W6300 block in the component Kconfig.
